{
    "Dublin Under Sail": " Under Sail departs from Dún Laoghaire Marina, County Dublin, and allows you to experience life on board a traditional sailing vessel. Be a part of the crew, set the sails, heave the ropes, climb the rigging, and man the wheel. Enjoy the stunning beauty of Dublin’s iconic bay under the red-cloth sails of the Brian Boru.",
    "Wanderlust Irland - Belfast Tour From Dublin": " North has become a must-see for any traveler and lover of Ireland. This tour enables you to focus on the beautiful city of Belfast, birthplace of the Titanic.",
    "Rural Adventure Tours": " Adventure Tours, based in Cootehill, County Cavan, take visitors on private day and multi day tours into the heartlands of Ireland. Visitors can experience the beauty, culture, ancient stories, music and renowned pubs of Ireland as well as adventure activities.",
    "Cliffs Of Moher - Paddywagon Tours": " the majestic Cliffs of Moher, one of the most spectacular cliffs in the world. Rising 820 ft above sea level, the cliffs give you an opportunity to take in breathtaking views of the Aran Islands and Galway Bay.",
    "HikeandClimb": " based in County Dublin, is a provider of adventure, rock climbing and mountaineering skills for visitors to Ireland's Ancient East region. Their goal is to enable a personalised, tailored and original experience in suitable locations around the country.",
    "Irish Cycling Safaris": " Cycling Safaris provide group self-guided cycling tours in Ireland, offering wonderful sights and charming accommodation. Bespoke and custom tours can be arranged. Cycling Safaris guarantee a fun and friendly experience to all types of cyclists.",
    "Dublin Wine Trails": " wine trail around Dublin that is steeped in local flavour. Soak up the amazing atmosphere and enjoy what this cobble-stoned, charming city has to offer. Taste an exciting line up of wines and tapas style bites in a fun and social environment.",
    "Excursiones Irlanda - Giant’s Causeway Tour": " that you are in Ireland do not miss the chance to visit the legendary Giant´s Causeway! This tour includes the entrance fee for the Giant´s Causeway Visitor Center and you will be provided with free audio guides.",
    "Hollywood Lakes Golf Club": " Lakes Golf Club is one of the best parkland golf clubs in Dublin. Measuring more than 6,600 yds, it boasts some of the most spectacular scenery overlooking Dublin and Lambay Island.",
    "Howth-Boats": "-Boats are a boat hire and charter fishing service based on the West Pier in Howth, County Dublin.",
    "Wild N Happy Travel": " the natural beauty and scenery of Ireland on an outstanding trip with Wild N Happy in Aghadoe, Co. Kerry. Join an adventure tour, explore the coast by bike or have some family friendly fun in incredible settings.",
    "A Spasso A Dublino - Italian Tour In Dublin" : "A Spasso A Dublino - Italian Tour in Dublin provides Italian walking tours around the city, every day, Our Dublin (10:00) and The Life of U2 (10:30). Tour Di Dublino A Piedi in Italiano - La Vostra Dublino e La Vita Degli U2.",
    "Cliffs Of Moher - Finn McCools Tours:The Cliffs of Moher is the most popular day tour from Dublin. And also the most popular day tour in Ireland for a good reason": " it is a spectacular sight not to be missed! Just sit back, relax and enjoy the best day tour with Finn McCools Tours.",
    "8 Day Wild Irish Rover - Vagabond Tours Of Ireland": " wild, it's Irish and its roving. The award winning 8 Day Wild Irish Rover - Vagabond Tours of Ireland includes a night in a castle, two nights in Dingle town and a great variety of activity options and historical sites for each day.",
    "Explorium": " is ideal for a family day out. A real 21st century hands-on experience where science and sport meet, with over 300 interactive exhibits designed to ignite curiosity in its visitors. For everyone age 2 years and up.",
    "Pat Liddy's Walking Tours Of Dublin Ltd": " Liddy's Walking Tours of Dublin offer both scheduled and private walking tours of Dublin City. Historian Pat Liddy and his team of highly knowledgeable and enthusiastic guides will point out hidden gems and their stories, as well as the famous places. Starting points vary depending on the tour.",
    "The Rink At D12": "'s Roller Disco, The Rink at D12. The 4,500 square foot roller disco is perfect for nights out with friends, children’s birthday parties or as a great way to keep fit.",
    "Irish Secret Sights": " Secret Sights - Presentation of Ireland s most ancient and Haunted Castles in Ireland.",
    "Wicklow, Glendalough & Kilkenny Day Tour - Hilltoptreks": " some of Ireland’s hidden gems in Ireland’s Ancient East on this day tour from Dublin City. Walk in the valley of Glendalough surrounded by nature and visit an Irish castle in Kilkenny City.",
    "Dublin Literary Pub Crawl": " number 4 in The World's 50 Best Walks by the Sunday Times, this is an award winning show that crawls from pub to pub with professional actors performing from the works of Dublin's most famous writers, Joyce, Beckett, Oscar Wilde, Brendan Behan and many more.",
    "Ralph Smyth Tours": " you ever wondered where Dublin city got its name from, where the Vikings lived in Dublin, which is the oldest church in the city, where were the city walls? If so, why not enjoy a fascinating two hour walking tour of the ancient heart of Dublin with a professional tour guide.",
    "Wanderlust Irland - Cliffs Of Moher Tour From Dublin": " that you are in Ireland do not miss the chance to visit the breathtaking Cliffs of Moher! This tour includes the entrance fee for the Cliffs of Moher Center. You will also enjoy a scenic drive along the Wild Atlantic Way Coast.",
    "GoQuest": ", Carrickmines, County Dublin is a multi-challenge indoor arena of 27 rooms where groups of three to five persons compete against the clock. Each room consists of a light physical, mental or skill challenge. It is suitable for older children, teenagers and adults.",
    "U2'S Dublin - See Dublin By Bike": "2's Dublin - a guided tour by bike of Dublin city. This tour makes particular reference to the places associated with the members of U2, one of the world's greatest rock bands that started here.",
    "Dublin Falconry": " Falconry is now situated in Luttrellstown Castle Resort in Dublin 15. Visitors learn the art of falconry, with flying displays and hands-on experiences. They cater for everyone including children and special-needs customers. Handle your hawk and get a selfie with it. They also offer Owl experiences for great memories.",
    "Wild Food Events": " Wild Food Events in Killiney, South County Dublin, for a wild food walk along the beautiful Killiney coastline. Discover the delicious wild edibles that grow all around us. Learn how to turn them into tasty treats, zingy cocktails and simple home remedies.",
    "Prestige Chauffeur Ltd.": " Chauffeur Ltd. is a luxury transport service based in Dublin .",
    "Wanderlust Irland - Wicklow, Kilkenny & Glendalough Tour From Dublin": " Dublin for this award winning and brilliant day trip with your 100% Irish Tour Guide and travel through the beautiful countryside of County Wicklow until we arrive in Glendalough.",
    "Touristy Ireland": " Ireland offer private guided tours all around Ireland. Get the most from your day by creating a customised tour plan that is perfectly suited to your needs. See all of Dublin in one day or visit Glendalough and Powerscourt in a half day.",
    "WILDIRISH Motorcycle Tours": " Motorcycle Tours of Ireland, Glenageary, County Dublin, are motorcycle tours that are designed to be fun. You can use your own motorcycle and ride at your own pace. All tours have a guided and self guided option with long or short route options.",
    "Activities Ireland": " to Activities Ireland. Here you'll find one of Ireland's leading ground-handling operator in golf breaks, golf tours, activity holidays and leisure breaks in Ireland, across Europe and abroad.",
    "Cronin's Coaches": " you travel with Cronin's Coaches, you travel in high style. You can sit back and relax, not worrying about maps, directions or getting lost.",
    "The Ireland Whiskey Trail": " award winning Ireland Whiskey Trail is a free touring guide to Ireland's distilleries, best whiskey pubs, hotel and golf club bars and specialised whiskey shops. It includes a free touring map in English, French and German.",
    "The Belfast Titanic Tour - Finn McCools Tours": " the capital city of Northern Ireland, Belfast has a lot to offer. With tourism in Northern Ireland growing at a phenomenal pace, this day tour from Dublin truly shows you the best Northern Ireland has to offer in a day.",
    "The Galway Gravedigger Bus Tour - Hidden Dublin Walks And Tours": " Galway Gravedigger Bus Tour provides a themed ghost bus tour with actor guides recounting tales of Galway's darker history. The tour includes a ghoulish drink in McHugh’s Bar.",
    "Rare Ireland Tours": " the fascinating story of Ireland through themed walking tours with Rare Ireland Tours, Dublin. Explore Ireland's military heritage on the Dublin's Military Mile walking tour and the living story of Dublin, from Viking times to today, on the Loving the Liberties walking tour.",
    "Irish Welcome Tours": " Welcome Tours is one of Ireland's leading incoming tour operators and destination management companies, in operation since 1989.",
    "Solve A Mystery": " A Mystery is a mystery walking tour in Dublin City. This murder mystery trail is inspired by true events. As an investigator, it is your duty to solve the mysterious disappearance. You must gather sufficient evidence and find the right suspect to ensure the safety of Dublin City streets.",
    "Irlanda In Italiano": " in Italiano provide Italian language tours to visitors to Ireland who do not have a proficient level of English.",
    "Escape Dublin": " Dublin is a fun, challenging live escape game. Try the Witchcraft & Wizardry school, help Sherlock Holmes solve a mystery, or find the cure in the Contagion Rooms. Do you have what it takes to solve the clues and escape in 60 minutes?",
    "Curran Golf": " Golf is the gateway to your dream golf vacation in Ireland. Curran Golf are specialists in bespoke golf vacations and cater for your every need including tee times, accommodation, transport, club hire and anything else you may require.",
    "Executive Travel Solutions": " Travel Solutions, based in County Galway, with offices also in Dublin City, offer private guided tours of Ireland with a full executive chauffeur service. Luxury mini coach hire can also be arranged. Sit back and relax in luxury vehicles, while being taken to your destination.",
    "Wicklow Day Tour - Coach Tours Of Ireland": " Day Tour of Wicklow departs from Dublin daily, taking in the breathtaking scenery of the Wicklow Mountains, Glencree, Sally Gap, Lough Tay, Glendalough, The Meeting of the Waters and Avoca (Ballykissangel).",
    "My Ireland Tour - Ancient Ireland Mini-Group Tour": " like royalty on a tour of Ireland that gets you closer to some of Ireland's best loved attractions. With only eight guests per tour, there is more time and freedom to explore your own interests.",
    "Private Giants Causeway Day Tour With Kennedy & Carr": " Giants Causeway & Belfast on this private day tour from Dublin. Enjoy your own private tour vehicle and driver guide with collection from your Dublin hotel.",
    "Excursiones Irlanda - Cliffs Of Moher Day Tour": " of Moher Day Tour From Dublin. Travel from the banks of Dublin´s river Liffey to Ireland´s Wild Atlantic Way and experience the biggest attraction in all of Ireland.",
    "Celts & Castles Tour - Hilltoptreks": " Celts & Castles Tour from Dublin City with Hilltoptreks brings you to the counties of Meath and Louth. Hear stories and history from the first settlers in Ireland to the Celts, Vikings, Anglo-Normans, and up to the present day.",
    "Rosie's Jigs And Wigs": " to dress up like a 'reel' Irish dancer so you can channel your inner Michael Flatley? At Rosie's Jigs and Wigs, at The Hardcourt Hotel in Dublin City centre, try on the costumes, learn the basic Irish dancing steps and enjoy an Irish themed photoshoot.",
    "The Chocolate Warehouse": " Chocolate Warehouse, in Walkinstown Dublin, is a family friendly venue where visitors can enjoy the story of chocolate with a hands on experience of making chocolates where you get to bring home your own creations. Happy memories!",
    "Rabbie’s Small Group Tours": " off the beaten track with Rabbie’s Tours of Ireland and discover the best of the Emerald Isle. You’ll join a small group tour of up to 16 people and explore all the country has to offer, from dramatic landscapes to spectacular traditions!"
}

