[
    {"id": 0, "name": "CHQ Dublin", "desc": "The CHQ Dublin building is a retail and events hub on the banks of the the River Liffey and George’s Dock in Dublin City centre. CHQ stands for Custom House Quay."},
    {"id": 1, "name": "Butlers Chocolate Café - Wicklow Street", "desc": "Experience two pleasures together. Delicious coffee and mouth watering luxury chocolates at your nearest Butlers Chocolate Café."},
    {"id": 2, "name": "The Roastery Café", "desc": "The Roastery Café is a key part of the unique Roastery experience. It is located in Java Republic headquarters in Ballycoolin. It is a full working café where they serve breakfast, lunch, fresh hand roasted barista blends and 24 organic teas to hundreds of customers every day."},
    {"id": 3, "name": "National Basketball Arena", "desc": "The National Basketball Arena, opened in 1993, is Ireland's premier indoor sports facility with permanent seating for 2,100 and 18,000 sq ft of floor space."},
    {"id": 4, "name": "Counter Culture", "desc": "Counter Culture is a Health food restaurant and outside catering business. Open 7 days a week. Counter Culture also have a juice bar and café menu. Brunch is served 7 Mornings a week and all day Saturday."},
    {"id": 5, "name": "Brother Hubbard North", "desc": "A friendly, independent café, focusing on quality and freshness of ingredients. Everything on the menu is prepared in house, from the breakfast, brunch and award winning lunch items, to the baked goods and soft drinks."},
    {"id": 6, "name": "Queen Of Tarts", "desc": "Queen of Tarts is in the heart of Dublin City centre on Cows Lane and Dame Street, minutes from Temple Bar. Queen of Tarts offers an assortment of home baked goodies with a pastry shop and café."},
    {"id": 7, "name": "Community Coffee", "desc": "Community Coffee is an outlet serving quality coffee in the heart of Dundrum Village in South Dublin. Located beside the iconic Uncle Tom’s Cabin, Community Coffee also provides a generous ‘green’ seating area for friends and families."},
    {"id": 8, "name": "Monck's Green", "desc": "Monck's Green, formerly Woodstock, is located on the Phibsborough Rd. It is a trendy café bar with functional décor. It has polished concrete floors and exposed beams. Monck's Green is open for breakfast, brunch and lunch."},
    {"id": 9, "name": "Lemon Crepe And Coffee Co.", "desc": "Lemon Crepe & Coffee Co. operate two charming little creperies in Dublin's city centre, offering both sweet and savoury crepes, as well as expertly prepared coffees."},
    {"id": 10, "name": "Irish Film Institute Café Bar", "desc": "Fancy a bargain movie and meal, then pop into the Irish Film Institute Café Bar in Temple Bar."},
    {"id": 11, "name": "Urban Plant Life Garden Centre", "desc": "Urban Plant Life Garden Centre is located in Dublin's historic Liberties district. You'll find shrubs, climbers, roses, interior & artificial flowering/foliage plants, sundries, decorative pots and so much more."},
    {"id": 12, "name": "Overends", "desc": "Overends is the perfect place to enjoy the taste of Airfield with amazing meals and treats created with fresh produce sourced from Airfield's farm and gardens. A unique field to fork experience in Dublin."},
    {"id": 13, "name": "Itsa", "desc": "Itsa bagel serves gourmet fast food, delicious filled bagels, soups, fresh juices and homemade goodies."},
    {"id": 14, "name": "Bewley's Café Grafton Street", "desc": "Opened over 80 years ago, Bewley's Grafton Street Café is a cherished Dublin landmark and Ireland's longest established and largest café, serving excellent food from breakfast through lunch to evening cuisine."},
    {"id": 15, "name": "Chewbrew", "desc": "Chewbrew is a bubble tea room in Dublin serving Taiwanese inspired drinks from milk teas, fruity milks, iced teas, matcha drinks and frappes with a huge array of toppings seven days a week."},
    {"id": 16, "name": "KC Peaches - St. Stephen's Green", "desc": "KC Peaches St. Stephen's Green is positioned right beside the renowned Shelbourne Hotel at the corner of the Green itself. Grab a salad box to take into the park or sit yourself down in the cafe and take in the busy surroundings of the Green."},
    {"id": 17, "name": "Butlers Chocolate Café - Henry Street", "desc": "Experience two pleasures together, delicious coffee and mouth watering luxury chocolates at your nearest Butlers Chocolate Café."},
    {"id": 18, "name": "Brother Hubbard South", "desc": "A friendly, independent café, focusing on quality and freshness of ingredients. Everything on the menu is prepared in house, from the breakfast, brunch and award-winning lunch items, to the baked goods and soft drinks."},
    {"id": 19, "name": "Keogh's Café", "desc": "Keogh's Café is located on Trinity Street in the heart of Dublin City centre, minutes walk from Grafton Street, St. Stephens Green and Trinity College. Keogh's Café serves healthy home cooked food and is open for breakfast, lunch and dinner."},
    {"id": 20, "name": "Lemon Jelly Café", "desc": "Lemon Jelly is a fresh, young cafe located on Millenium Walkway in Dublin City centre, minutes from Jervis Street shopping centre, The Ha'Penny Bridge and Temple Bar."},
    {"id": 21, "name": "Le Petit Parisien", "desc": "Le Petit Parisien was borne out of genuine love for French fare. The bakery, the patisserie and the unique culture that is the French coffee shops of 1920s Paris."},
    {"id": 22, "name": "Happy Out Café;Happy Out café on Bull Island in Clontarf", "desc": " serving locally roasted, specialty coffee from Roasted Brown and tasty, homemade toasties. Happy Out is there for people to escape the city and chill while sipping on lovely coffees and enjoying the breeze."},
    {"id": 23, "name": "64 Wine", "desc": "64 Wine is one of Ireland's leading wine shop and wine bar combinations, located in Glasthule, County Dublin. All wines are sourced from small, artisan producers who are as passionate about quality produce as 64 Wine."},
    {"id": 24, "name": "House Of Read Fine Foods & Tableware", "desc": "House of Read Fine Foods & Tableware on Parliament Street, is Dublin City's oldest shop. It first opened in 1670 and has the distinction as being purveyors of delicious chocolates, eclairs, macaroon coffees, pastries, treats and sweets to takeaway or as a gift."},
    {"id": 25, "name": "KC Peaches - Dame Street", "desc": "KC Peaches Dame Street is situated right in the heart of the city centre in the buzz of Temple Bar. The cafe may seem petite from the outside but don’t be fooled, there is more seating upstairs with the newly renovated loft and tea room."},
    {"id": 26, "name": "Purr Café", "desc": "Purr Café in North Brunswick Street is part of the Phibsboro Cat Rescue Centre. This vegan café welcomes visitors to meet their cats and kittens in the kitty play room."},
    {"id": 27, "name": "Counter Culture", "desc": "Counter Culture is a Health food restaurant and outside catering business. Open 7 days a week. Counter Culture also have a juice bar and café menu. Brunch is served 7 Mornings a week and all day Saturday."},
    {"id": 28, "name": "Gravity Climbing Centre", "desc": "Gravity Climbing Centre provides a world class climbing wall close to the heart of Dublin City. It offers the best indoor bouldering in Ireland."},
    {"id": 29, "name": "Chorus Café", "desc": "Chorus Café is located in the heart of Dublin city centre on Fishamble street, within walking distance to all major hotels and tourist attractions in the city. Chorus Cafe is open Monday to Saturday serving breakfast and lunch."},
    {"id": 30, "name": "Taste Café", "desc": "Taste Café on South William St in the heart of Dublin City, boasts an impressive selection of coffees and teas, supplemented by a great selection of delicious food. It is open 7 days a week for breakfast, lunch, brunch, dinner, antipasti and mini tastes."},
    {"id": 31, "name": "Reilly's Bar", "desc": "Reilly's Bar is a welcoming, traditional, local Irish pub serving up tasty food daily. The quaint little pub is packed full of heart, friendly staff and steeped in Irish history."}
]

