[
    {
        "id": 0, "name": "El Bahia Moroccan Restaurant", "desc": " Bahia is an authentic Moroccan restaurant in the heart of Dublin, comprising four rooms, each decorated in individual, ethnic styles. Moroccan and Arabic music enhances the Moorish experience. A belly dancer can be added for special occasions."
    },
    {
        "id": 1, "name": "Pichet Restaurant", "desc": " Restaurant serves European cuisine with worldwide influences, while always using the finest local produce wherever possible. Located on Trinity Street, close to Dublin Castle, Trinity College and Grafton Street."
    },
    {
        "id": 2, "name": "Dublin Wine Trails", "desc": " wine trail around Dublin that is steeped in local flavour. Soak up the amazing atmosphere and enjoy what this cobble-stoned, charming city has to offer. Taste an exciting line up of wines and tapas style bites in a fun and social environment."
    },
    {
        "id": 3, "name": "Brasserie Sixty6", "desc": " Brasserie Sixty6 aims to bring an innovative accessible menu of the highest quality food and an expertly chosen wine list to diners in funky, stylish surroundings, all at a reasonable cost to you."
    },
    {
        "id": 4, "name": "The Sussex", "desc": " above one of Dublin’s oldest and finest pubs, The Sussex restaurant is just minutes from Dublin City Centre located off the infamous Lesson Street Bridge."
    },
    {
        "id": 5, "name": "Lali's Restaurant", "desc": " is an Italian restaurant situated on the seafront in Dublin's coastal town Portmarnock. Lalis Restaurant has beautiful sea views and a small dining area for an intimate and cosy feel."
    },
    {
        "id": 6, "name": "Olesya's Wine Bar & Bistro", "desc": "'s Wine Bar & Bistro is an intimate upmarket wine bar and bistro located on Exchequer Street, Dublin 2, two minutes stroll from Grafton Street."
    },
    {
        "id": 7, "name": "Divino Italian Tapas Restaurant", "desc": " in scenic Skerries, north of Dublin, Divino is an authentic Italian-owned Tapas Restaurant serving high-quality food for Breakfast, Lunch & Dinner. Offers wine, seafood, steak & more in a casual, warm venue. Walk-in or phone for reservations"
    },
    {
        "id": 8, "name": "Le Monde Bistro", "desc": " Monde in Dun Laoghaire tempts visitors with a range of delicacies, all carefully crafted and beautifully presented."
    },
    {
        "id": 9, "name": "Jaipur", "desc": " stylish south County Dublin branch of a privately owned group of highly-regarded progressive Indian restaurants is well-established as a favourite in the area."
    },
    {
        "id": 10, "name": "La Cave Wine Bar & Restaurant", "desc": " Cave Wine Bar & Restaurant, located on South Anne St, is Dublin city's oldest wine bar. Relax in a cosmopolitan and vibrant atmosphere and enjoy excellent gourmet French cuisine at an affordable price."
    },
    {
        "id": 11, "name": "Craft Beer & Seafood Trail", "desc": " better way to spend an afternoon than eating some of the best locally caught seafood in Ireland, washed down with an ample amount of local craft beer. Whilst listening to tales of Ancient Ireland. This experience has it all!!"
    },
    {
        "id": 12, "name": "F.X. Buckley Crow Street", "desc": " away off Dame Street, F.X. Buckley Crow Street is a restaurant and meeting place for Dubliners and visitors to Dublin City."
    },
    {
        "id": 13, "name": "Eatokyo Asian Street Food", "desc": ", Talbot Street is situated in the heart of Dublin City centre, just off O’Connell Street, bringing Asian street food and sushi to the heart of the city. Enjoy a great atmosphere, food and service seven days a week."
    },
    {
        "id": 14, "name": "CHQ Dublin", "desc": " CHQ Dublin building is a retail and events hub on the banks of the the River Liffey and George’s Dock in Dublin City centre. CHQ stands for Custom House Quay."
    },
    {
        "id": 15, "name": "Toscana Restaurant City Centre Dublin", "desc": " is ideally located opposite Dublin Castle beside the Temple Bar district. Toscana restaurant takes inspiration from their organic gardens in Co. Wicklow to bring the spirit of Italian cooking onto their chopping boards here in the city."
    },
    {
        "id": 16, "name": "Brady's Of Shankill", "desc": " pub-restaurant situated in the heart of Shankill village in south County Dublin. Comprising a large, comfortable lounge and lively bar (Mickey Byrne’s), Brady’s offers top-quality carvery and bar food menus at prices that won’t break the bank."
    },
    {
        "id": 17, "name": "Camden Kitchen", "desc": " Kitchen is a modern neighbourhood Bistro, a restaurant with exceptional food, in an intimate setting. Situated about a 10 minute walk from St Stephen's Green, in Dublin City centre."
    },
    {
        "id": 18, "name": "La Caverna Restaurant And Wine Bar", "desc": " in the Temple Bar district in the heart of Dublin City centre, La Caverna Restaurant and Wine Bar welcomes you with its elegant setting and buzzy atmosphere."
    },
    {
        "id": 19, "name": "Guinea Pig", "desc": " Guinea Pig is located in the heritage town of Dalkey, 20 minutes by DART from Dublin city centre. The Guinea Pig prides itself on its locally sourced fresh fish, shellfish, beef and lamb, as well as offering an extensive vegetarian menu."
    },
    {
        "id": 20, "name": "Jewel In The Crown", "desc": " in the Crown is a family run Indian Mughal Shahi restaurant with two separate locations in the city. Each of these restaurants have the same name and have been serving locals and visitors for over 20 years."
    },
    {
        "id": 21, "name": "Balbriggan Fish And Farmers Market", "desc": " Fish and Farmers Market takes place every Friday from 10am-3pm in Balbriggan, County Dublin. A selection of stalls will sell fresh local produce, home-baking and much more."
    },
    {
        "id": 22, "name": "Bon Appetit Restaurant", "desc": " Appetit is synonymous with good food. Located in a Georgian Townhouse, overlooking the harbour in North Co. Dublin's Malahide, it offers three unique dining experiences; La Brasserie, Le Bon Vin and the Michelin starred jewel, Le Restaurant."
    },
    {
        "id": 23, "name": "Fade Street Social", "desc": " 8,000 square foot premises, housing a traditional restaurant, gastro bar, cocktail bar and rooftop terrace. The restaurant serves modern Irish cuisine, while the gastro bar serves a vast tapas style menu."
    },
    {
        "id": 24, "name": "Kilkenny Shop, Cafe & Restaurant", "desc": " on the first floor of the Kilkenny store, Nassau Street, this award winning Cafe and Restaurant affords a clear and pleasant view into the grounds of adjoining Trinity College. A culinary and visitor delight."
    },
    {
        "id": 25, "name": "McLoughlin's Restaurant", "desc": " Restaurant, located in Roganstown Hotel & Country Club just outside Swords Village."
    },
    {
        "id": 26, "name": "The Church, Café, Late Bar And Restaurant", "desc": " to The Church, Café, Late Bar and Restaurant where you can enjoy coffee, drinks, great Irish food and traditional Irish music in one of Ireland’s most unique venues based in the heart of Dublin City."
    },
    {
        "id": 27, "name": "FIRE Steakhouse & Bar", "desc": " Steakhouse & Bar is a multi-award winning venue, located in the heart of Dublin city centre, offering a range of dining options."
    },
    {
        "id": 28, "name": "Hanora D Restaurant", "desc": " in Lucan Spa Hotel, just West of Dublin City, the Hanora D' Restuarant is a classic & elegant Edwardian-style dining room offering the best of Irish & European Cuisine. It's a lovely place for a relaxing Sunday Lunch or Dinner to suit all."
    },
    {
        "id": 29, "name": "Wagamama - Dundrum", "desc": " Japanese-inspired menu that features a wide variety of noodle and rice dishes, as well as delicious salads and side dishes, desserts, freshly squeezed juices, hot drinks, wine, sake and Asian beers."
    },
    {
        "id": 30, "name": "Winding Stair Bookshop And Restaurant", "desc": " good views over the Liffey. An 18th Century staircase connects the three floors, all of which are packed with books. Classical music plays in the background as the readers digest. Reading held regularly."
    },
    {
        "id": 31, "name": "McGettigans Cookhouse & Bar", "desc": " Cookhouse & Bar offers the best of both traditional Irish dishes and international cuisine. The restaurant is part of the The Address Connolly hotel, located in Dublin City centre."
    },
    {
        "id": 32, "name": "The Old Schoolhouse Restaurant", "desc": " Old Schoolhouse Restaurant, in Swords Village, north of Dublin, was an 18th century schoolhouse. Locally-sourced steak, game & seafood are specialties. A large menu & live music are offered, with an adjacent beer garden & bar with sports screens."
    },
    {
        "id": 33, "name": "Farmleigh Food Market", "desc": " Food Market has a range of home-baking and homegrown produce from all over Ireland. It offers shoppers a selection of fresh food choices for their culinary pleasure. The market takes place in Dublin city. Check the website for dates."
    },
    {
        "id": 34, "name": "Bang Restaurant", "desc": " Restaurant, situated in the city centre near St Stephen's Green, serves quality food at affordable prices, in a relaxed and informal setting."
    },
    {
        "id": 35, "name": "Counter Culture", "desc": " Culture is a Health food restaurant and outside catering business. Open 7 days a week. Counter Culture also have a juice bar and café menu. Brunch is served 7 Mornings a week and all day Saturday."
    },
    {
        "id": 36, "name": "Wing’s Gourmet Burger", "desc": "’s Gourmet Burger are a cafe, breakfast, sandwich, salads and European food restaurant."
    },
    {
        "id": 37, "name": "TGI Fridays Blanchardstown", "desc": " Fridays in Blanchardstown is an American style restaurant located in the Blanchardstown Shopping Centre, 10kn North-West of Dublin city centre."
    },
    {
        "id": 38, "name": "Harry's On The Green", "desc": "'s on the Green is Dublin's only premier Manhattan style Cocktail bar with a superb food menu, great live entertainment and DJ's."
    },
    {
        "id": 39, "name": "Ragazzi Italian Restaurant", "desc": " busy, little Italian bistro in the seaside town of Dalkey is the perfect place to enjoy some traditional Italian food."
    },
    {
        "id": 40, "name": "Casa Pasta Clontarf", "desc": " Pasta is situated on the main thoroughfare in Clontarf overlooking Dublin Bay. Casa Pasta Clontarf has an extensive menu of modern European and Italian food based on good quality Irish ingredients in a family friendly environment."
    },
    {
        "id": 41, "name": "Yung's Restaurant", "desc": "'s Restaurant is located in the charming coastal town of Dun Laoghaire, on Dublin's southside. It offers traditional Chinese fare and also provides a takeaway service."
    },
    {
        "id": 42, "name": "Aqua Restaurant", "desc": " waterside location with fresh fish delivered daily."
    },
    {
        "id": 43, "name": "Sano Pizza", "desc": " Pizza is an authentic Neapolitan Pizzeria located in Temple Bar in Dublin. They use ovens imported from Naples, trained Neapolitan Pizzaiolos and only the freshest mix of local and Italian ingredients."
    },
    {
        "id": 44, "name": "Coppinger Row Outdoor Farmers Market", "desc": " Row Outdoor Farmers Market takes place every Thursday in Dublin city. Shoppers are invited to browse and buy from the array of stalls selling foods, crafts and much more."
    },
    {
        "id": 45, "name": "Rolys Bistro", "desc": "'s Restaurant & Cafe has remained one of the most popular eating places in Dublin since the restaurant first opened in 1992. Roly's introduced the busy, buzzing Brasserie concept, which they continue to deliver with great panache."
    },
    {
        "id": 46, "name": "Beshoffs Restaurant", "desc": " Fish & Chip Restaurant. Established in 1913, Beshoff's is an integral part of Dublin, from trawler to table the core ethos is sea fresh, wholesome fish and freshly cut chips."
    },
    {
        "id": 47, "name": "McGowans Of Phibsboro", "desc": " Gowans is situated on the Phibsboro Road, Dublin 7, 2km from O'Connell street in Dublin city centre. McGowans serve food daily until 10pm, both in the bar and in the front of house restaurant."
    },
    {
        "id": 48, "name": "The House", "desc": " House, Café, Restaurant, Bar and Deli is an award winning restaurant located in the middle of historic Howth Village."
    },
    {
        "id": 49, "name": "Moore Street Market", "desc": " Street Market is the scene of Dublin City's famous street barrow vendors. A selection of fruit, vegetables and flowers are available making this street full of colour."
    }
]

